{
  "long_term_memory": "Project: Connsura insurance matchmaking app with React frontend and Node/Express backend.\n\nRepo layout:\n- connsura-frontend (React/Vite UI)\n- connsura-backend (Express API + Prisma)\n- automation (PowerShell + SSH deploy tooling)\n- connsura-ai-system (docs and automation rules)\n- memtool (project memory tooling)\n\nData model:\n- PostgreSQL in staging and local dev via Prisma models: User, Agent, Customer, Message, Driver, Vehicle, AdminUser, AuditLog, ProfileShare.\n- User includes emailVerified boolean for OTP verification gating.\n- User includes totpEnabled, encrypted totpSecret, unique totpRecoveryId, totpBackupCodes, totpBackupCodesUpdatedAt for authenticator recovery.\n- Agent/Customer list fields are JSON strings (languages, states, products, coverages, etc).\n- Customer no longer stores preferred agent or sharedWithAgent (internal preferred-agent flow removed).\n- ProfileShare stores share token + code hash, sections, snapshot, editable flag, status, pending edits, optional recipient name, and last access time.\n\nAPIs:\n- Backend routes: /auth, /agents, /customers, /search, /quotes, /contact, /admin, /messages, /shares.\n- Auth recovery: /auth/totp/setup, /auth/totp/confirm, /auth/totp/backup-codes, /auth/totp/disable, /auth/recovery/reset (email or recovery ID + authenticator or backup code, returns auth token).\n- Share flow: /shares (create), /shares/:token/verify (code + optional name), /shares/:token/edits, /shares/:token/approve, /shares/:token/decline, /shares/:token/revoke, /shares/:token/close.\n- Static: /uploads and /forms served by backend.\n\nDeployment:\n- Orchestrator: Windows 11 runs automation/master.ps1.\n- Staging server: AWS EC2 Ubuntu 22.04.5 LTS in us-east-1 with an Elastic IP.\n- Deploys use automation/.env pointing to AWS; routine flow is commit/push then automation/master.ps1 -SkipDns.\n- Nginx reverse proxy, Docker Compose for backend (8000) and frontend (4173).\n- Domains: staging.connsura.com and api.staging.connsura.com.\n- Deployment logs: /opt/connsura/deployments.log (server) and automation/deployments.log (local).\n- Budget guardrails: AWS Budget alert at  and auto-stop at  (manual restart required).\n\nDecisions:\n- PostgreSQL for staging persistence.\n- Vite preview used for frontend in staging behind Nginx.\n- Staging moved from a home server to AWS EC2 (us-east-1) with Elastic IP; deploys target AWS by default.\n- Homepage hero and key sections now use a shared background image with a layered 3D gradient (bg-3d) and translucent cards.\n- Create Profile page uses section-based modal forms with add/edit/remove and summary cards for household, address, vehicle, and business; only one section is visible at a time.\n- Create Profile CTA opens customer auth modal and redirects to client dashboard Forms tab after login/signup.\n- Profile sharing is gated by email verification (OTP) and uses a 4-digit code + optional recipient name for public links.\n- Editable share links send changes for client approval before persisting.\n- Optional Google Authenticator recovery with backup codes and recovery ID; /recover flow auto-logs in after reset.\n- Settings include authenticator setup with an Overview reminder when not enabled.\n- TOTP secrets encrypted with TOTP_ENCRYPTION_KEY (fallback to JWT_SECRET).\n- SSH + Playwright automation for provisioning and Squarespace DNS.\n\nOpen questions:\n- Production environment and hosting plan not documented.\n- Staging data seeding strategy not documented.\n- Memtool embeddings require a valid OpenAI API key.\n\nNext steps:\n- Update memory after each deploy or major feature.\n- If API key is available, index docs with memtool for embeddings.",
  "messages": [],
  "docs_index": {
    "embedding_model": "text-embedding-3-small",
    "chunks": []
  }
}